src/integ-test/bdd-test/resources/xml/sendPaymentOutcomeBody_noOptional.xml

            
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:sendPaymentOutcomeReq>
            <idPSP>$idPSP</idPSP>
            <idBrokerPSP>$idBrokerPSP</idBrokerPSP>
            <idChannel>$idChannel</idChannel>
            <password>$password</password>
            <paymentToken>$paymentToken</paymentToken>
            <outcome>$outcome</outcome>
        </nod:sendPaymentOutcomeReq>
    </soapenv:Body>
</soapenv:Envelope>